"use client";

import { motion } from "framer-motion";

const SliderText = () => {
  return (
    <motion.div
      initial={{ opacity: 0 }}
      animate={{ opacity: 1 }}
      transition={{ delay: 0.3 }}
      className="text-center  mx-auto mb-12  text-black p-8 rounded-lg shadow-lg"
    >
      <h1 className="text-3xl font-bold mb-6">আমার ওজন কি কমবে কিংবা মেদ/ভুঁড়ি কমবে?</h1>
      <p className="text-lg leading-relaxed mb-8">
        ওজন বৃদ্ধির বিভিন্ন কারণ থাকতে পারে। কেউ জেনেটিক্যালি ও হরমোনাল সমস্যার কারণে হয় অথবা কারও আবার খাবার
        অনিয়ন্ত্রিত হলে হয় । আসলে ওজন বৃদ্ধি শুরু হওয়ার আগে আমরা খুব কম মানুষই শরীরের যত্ন নিই। কিন্তু সময় থাকতে আপনি
        সঠিকভাবে যত্ন নিলে আপনি একদম মোটা হয়ে যাওয়া থেকে রক্ষা পাবেন। শরীরের জন্য উপকারী প্রায় ১০ টি প্রাকৃতিক উপাদানে
        তৈরি আমাদের Premium Collagen Coffee যার মধ্যে রয়েছে অ্যামিনো অ্যাসিড যা আপনার ওজন বৃদ্ধিতে বাধা প্রদান করে, এর
        সাথে রয়েছে পর্যাপ্ত পরিমাণে ভিটামিন সি যা আপনার দ্রুত ওয়েট লস করতে সহযোগিতা করে।ব্যবহারে ৫-১০ কেজি ওজন
        অনায়াসেই কমবে, মেদ /ভুড়ি কমবে,ত্বক সজীব রাখবে,ত্বকের তারুণ্যতা ধরে রাখবে। কোলাজেন কফি ব্যবহারের অল্প কিছুদিনের
        মধ্যেই আপনি পরিবর্তন টা বুঝতে পারবেন। মোটকথা আপনার ওজন কমিয়ে আপনাকে ফিট রাখার জন্য আমাদের এই কোলাজেন কফিই যথেষ্ট
        ।
      </p>
    </motion.div>
  );
};

export default SliderText;
